{
  "url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignments-dashboard-scores-incorrect-missing/166816/76",
  "main_post": {
    "post_id": "596870",
    "content": "@23f2005283\nI can confirm that week 2 is 90 on our server.\nWe will fix it on dashboard. Thanks for brining it to our attention.\nKind regards",
    "date": "Feb 19",
    "links": [
      "@23f2005283"
    ]
  },
  "replies": [
    {
      "post_id": "596872",
      "content": "@23f2000237 I can confirm that on our back end server it is 90.\nWe will fix it in the dashboard. Thanks for brining it to our attention.\nKind regards",
      "date": "Feb 19",
      "links": [
        "@23f2000237"
      ]
    },
    {
      "post_id": "596873",
      "content": "@22f2000559 We can confirm that your week 1 and week 2 scores are 57.5 and 70 respectively on the back end server. We will fix it in the dashboard and thanks for brining it to our attention.\nKind regards",
      "date": "Feb 19",
      "links": [
        "@22f2000559"
      ]
    },
    {
      "post_id": "596874",
      "content": "@23f2000237 I can confirm that your ga4 is 90 on our back end server. We will fix it in dashboard and thanks for brining it to our attention.\nKind regards",
      "date": "Feb 19",
      "links": [
        "@23f2000237"
      ]
    },
    {
      "post_id": "596875",
      "content": "@23F3004407_RATANPRIY I can confirm that your GA3 score is 84.2 on our backend server. We will push it to dashboard. Thanks for brining it to our attention.\nKind regards",
      "date": "Feb 19",
      "links": [
        "@23F3004407_RATANPRIY"
      ]
    },
    {
      "post_id": "596876",
      "content": "@22f3000370 I can confirm that on the back end server we have your scores for week 2 and week 4 as 40 and 80 respectively. We will push these to the dashboard. Thanks for notifying us.\nKind regards",
      "date": "Feb 19",
      "links": [
        "@22f3000370"
      ]
    },
    {
      "post_id": "596877",
      "content": "But sir my last scored marks was 7.5 when i submitted. Then how my score is 63.2. @carlton",
      "date": "Feb 19",
      "links": [
        "@carlton"
      ]
    },
    {
      "post_id": "596886",
      "content": "@dshail We have your weekly scores as\n75.0, 100.0, 89.5, 70.0 on our back end server\n\nWe will update the dashboard and thanks for brining it to our attention.\nKind regards",
      "date": "Feb 19",
      "links": [
        "@dshail"
      ]
    },
    {
      "post_id": "596888",
      "content": "because the previous score that you received was what you scored after the deadline. We had accidentally given students marks to students who submitted after the deadline. Here is the evidence.\n\nScreenshot 2025-02-19 at 11.59.39 am\n2630×288 17.6 KB\n\nKind regards",
      "date": "Feb 19",
      "links": [
        "Screenshot 2025-02-19 at 11.59.39 am\n2630×288 17.6 KB"
      ]
    },
    {
      "post_id": "596889",
      "content": "@24ds3000061 I can confirm that you have 20 and 30 for weeks 2 and week 4 on our back end server. We will fix it in dashboard and thanks for brining it to our attention.\nKind regards",
      "date": "Feb 19",
      "links": [
        "@24ds3000061"
      ]
    },
    {
      "post_id": "596890",
      "content": "@HARISH.S I can confirm that our back end server has recorded these scores for you 87.5, 65, 90 for week 1 , 2 and 4\n\nWe will fix it in the dashboard, and thanks for bringing it to our attention.\nKind regards",
      "date": "Feb 19",
      "links": [
        "@HARISH.S"
      ]
    },
    {
      "post_id": "596895",
      "content": "@AnvithaV I can confirm that you have\n\n5.0, 55.0, 73.7, 100.0 in weeks 1,2 ,3,4 respectively on our backend server.\nWe will fix it in dashboard, thanks for bringing it to our attention.\nKind regards",
      "date": "Feb 19",
      "links": [
        "@AnvithaV"
      ]
    },
    {
      "post_id": "597112",
      "content": "@carlton sir,\nI recently checked my marks for Tool in Data Science and noticed a major discrepancy. In the subject dashboard, my marks are shown as 100 , but in the main Dashboard, I have been awarded absent .\nThakur Vishalkumar Vinod\n23f2004320\n\n\nScreenshot 2025-02-18 182401\n1574×450 32.2 KB\n\n\nScreenshot 2025-02-18 182446\n1866×668 130 KB",
      "date": "Feb 19",
      "links": [
        "@carlton",
        "Screenshot 2025-02-18 182401\n1574×450 32.2 KB",
        "Screenshot 2025-02-18 182446\n1866×668 130 KB"
      ]
    },
    {
      "post_id": "597144",
      "content": "@23f2004320\n\nI have checked the backend server. The actual score is 85 in Module 1.\n\nIgnore seek portal, because scores are evaluated externally on our server. Those scores on seek portal are just from the placeholder question that asked whether you saw GA1 and attempted it. It has no bearing on your actual marks.\n\nThe actual score will be in the dashboard soon.\n\nKind regards.",
      "date": "Feb 19",
      "links": [
        "@23f2004320"
      ]
    },
    {
      "post_id": "597188",
      "content": "Sir for the GA3 the saved score says its 4.5, total is 9.5 so my total should be 47.4.",
      "date": "Feb 20",
      "links": []
    },
    {
      "post_id": "597208",
      "content": "@23f1002223\n\nScreenshot 2025-02-20 at 7.52.54 am\n2622×274 23.1 KB\n\nAccording to your submission history your last submission before the deadline was 3.5 (i.e. your score would be 36.8 out of 100)\n\nKind regards",
      "date": "Feb 20",
      "links": [
        "@23f1002223",
        "Screenshot 2025-02-20 at 7.52.54 am\n2622×274 23.1 KB"
      ]
    },
    {
      "post_id": "597361",
      "content": "@carlton, the error has been rectified, and the corrected mark has now been accurately reflected in the system.",
      "date": "Feb 20",
      "links": [
        "@carlton"
      ]
    },
    {
      "post_id": "597622",
      "content": "w2tdse\n1100×886 50.3 KB\n\nSorry for the late upload but as you can see in the screenshot i had submitted answers for TDS Week 2 graded assignment but it shows 0 both here and in current courses tab.\nI did reload the recent tab before uploading and for tds ga submission i submit and keep the tab open until the timer runs out.",
      "date": "Feb 21",
      "links": [
        "w2tdse\n1100×886 50.3 KB"
      ]
    },
    {
      "post_id": "597620",
      "content": "@shubham6 I have checked the backend server. It does show your score as 8 for GA2, so we have the correct score for you.\n\nCan you send me a screenshot of your dashboard (where your course cards are) thanks.\n\nKind regards",
      "date": "Feb 21",
      "links": [
        "@shubham6"
      ]
    }
  ]
}