{
  "url": "https://discourse.onlinedegree.iitm.ac.in/t/remote-online-exam-tds-jan-2025/168832/124",
  "main_post": {
    "post_id": "603124",
    "content": "Probably, by this week",
    "date": "Mar 3",
    "links": []
  },
  "replies": [
    {
      "post_id": "603125",
      "content": "I checked your submission, its at 1:47:30 PM. We are going to give a grace period of 2 minutes past 1:45 PM. Given that you submitted 30 seconds past 1:47, we won’t be able to consider it.\nRegards",
      "date": "Mar 3",
      "links": []
    },
    {
      "post_id": "603134",
      "content": "Please reconsider this decision. In the heat of the moment, I failed to save. In my mind, I was sure that I had saved it. There is one other student with the same problem ( saved a few seconds after 1:47).\n\nSince I did only one save, I would get zero marks if the score is not considered.\n\nI didn’t submit any new answer after 1:45 pm.\n\nPlease reconsider if possible.\n\n@Jivraj @carlton",
      "date": "Mar 3",
      "links": [
        "@Jivraj",
        "@carlton"
      ]
    },
    {
      "post_id": "603207",
      "content": "Thank you, much appreciated.",
      "date": "Mar 4",
      "links": []
    },
    {
      "post_id": "603251",
      "content": "Hi @Yogesh1 @24f2003130 @Muthupalaniappan\n\nQuick update: I discussed with internal team we are now giving an allowance till 1:48:00.\n\nKind regards",
      "date": "Mar 4",
      "links": [
        "@Yogesh1",
        "@24f2003130",
        "@Muthupalaniappan"
      ]
    },
    {
      "post_id": "603268",
      "content": "Hi @Jivraj sir,\n\nI sincerely appreciate the extension and the understanding from the course team. This really means a lot, and I am truly grateful for the support. Thank you for your time and effort in making this possible.\n\nKind regards,\nShambhavi Verma",
      "date": "Mar 4",
      "links": [
        "@Jivraj"
      ]
    },
    {
      "post_id": "603357",
      "content": "Thanks a lot for this.",
      "date": "Mar 4",
      "links": []
    },
    {
      "post_id": "604197",
      "content": "@24f2003130 @23f1002630 @23f2004169 @22f3001272\n\nThey only started pushing the scores a few minutes ago, so just wait for the update to finish. Check again and confirm after a few hours.\n\nThanks",
      "date": "Mar 7",
      "links": [
        "@24f2003130",
        "@23f1002630",
        "@23f2004169",
        "@22f3001272"
      ]
    },
    {
      "post_id": "604232",
      "content": "Am facing the same issue sir, will wait a few hours and update… I ensured I submitted atleast 5 times till 1:45",
      "date": "Mar 7",
      "links": []
    },
    {
      "post_id": "604292",
      "content": "I submitted 5 times minimum before 1:45 with a score of 7 @Jivraj @carlton out of curiosity i also submitted thrice after exam at like 2 or so just to know how to solve the other qs withscore of 9. I will get the 7 considered right? I submitted them at like 1:43 or so. Please confirm. It still shows absent",
      "date": "Mar 7",
      "links": [
        "@Jivraj",
        "@carlton"
      ]
    },
    {
      "post_id": "604297",
      "content": "@Jivraj @carlton\n\nDo we get bonus marks for submitting the student feedback Google Form?",
      "date": "Mar 7",
      "links": [
        "@Jivraj",
        "@carlton"
      ]
    },
    {
      "post_id": "604438",
      "content": "Sir , it is still showing absent for me for Roe result, I had submitted before the deadline as well my score was 2/10 but the result is showing absent. Can u please look into this and revert",
      "date": "Mar 8",
      "links": []
    },
    {
      "post_id": "604573",
      "content": "Any updates sir ? @carlton @Jivraj It was told, it will be updated in a few hours and now it’s been a day. Am scared!",
      "date": "Mar 8",
      "links": [
        "@carlton",
        "@Jivraj"
      ]
    },
    {
      "post_id": "604593",
      "content": "Dont worry, we have the right scores on our server. There has been some problem in sending the export to the operations team. Your scores are safe. We are working on figuring out the problem. Even the bonus marks are recorded. Just give us a couple of days to sort it out. Many students have been affected so we cant give individual responses right now. Its a system fix that needs to be implemented.",
      "date": "Mar 8",
      "links": []
    },
    {
      "post_id": "604761",
      "content": "Respected Sir,\n\nI noticed that my status is still marked as absent. I understand I may be a bit impatient, but I wanted to clarify my submission. I had submitted the ROE on time before 1:45 PM, though I was unaware that submissions were allowed until 1:47 PM.\n\nEven after the deadline, I attempted to increase my marks upon learning about the method to unlock the ROE. While I did make changes after the deadline, my initial submission before 1:45 PM had already secured some marks, meaning I was not absent. Additionally, I recall you mentioning in Project 1 that students should focus on the learning experience rather than just the marks when someone said that this term’s project was tougher than the last.\n\nEven if my increased marks were obtained after the deadline, they were still achieved by following all the given instructions and on my own terms and also everyone has different questions. If those changes were submitted in the same manner, I am unsure why they are not being considered. I understand it’s my mistake that I was not able to solve the entire ga in time but I had conditions which I had submitted in the feedback google form. Since this is a standalone degree for me, I’m actually worried about it. When I learned how to unlock the ROE, I completed it in a very short time.\n\nPlease consider the top marks even when did after the normal deadline as marks still got submitted\nrollnumber 23f2001390",
      "date": "Mar 9",
      "links": []
    },
    {
      "post_id": "604781",
      "content": "Screenshot 2025-03-09 at 2.42.50 pm\n1914×194 12.2 KB\n\nThe latest submission before the deadline would be 3 marks. That is what would be considered.",
      "date": "Mar 9",
      "links": [
        "Screenshot 2025-03-09 at 2.42.50 pm\n1914×194 12.2 KB"
      ]
    },
    {
      "post_id": "604817",
      "content": "Ok sir will the bonus 1 mark also be included for filling the gform, also I had scored 10 later is that also there or only 4 max is present?",
      "date": "Mar 9",
      "links": []
    },
    {
      "post_id": "604848",
      "content": "yes 1 bonus will be added if you filled the form according to the instructions.\n\nKind regards",
      "date": "Mar 9",
      "links": []
    }
  ]
}