{
  "url": "https://discourse.onlinedegree.iitm.ac.in/t/tds-ga7-score-missing/171500/9",
  "main_post": {
    "post_id": "614145",
    "content": "I have submitted GA 7 in TDS multiple times, inspite of this it is showing not submitted. Please inspect",
    "date": "Apr 1",
    "links": []
  },
  "replies": [
    {
      "post_id": "614163",
      "content": "@carlton @POD_TEAM how to peer review for GA7 where is the link??",
      "date": "Apr 1",
      "links": [
        "@carlton",
        "@POD_TEAM"
      ]
    },
    {
      "post_id": "615142",
      "content": "Dont worry about seek portal. GA 7 scores will only get pushed once peer reviews are done.\n(roughly 3 days before end term).\n\nKind regards",
      "date": "Apr 4",
      "links": []
    },
    {
      "post_id": "615548",
      "content": "@carlton @Jivraj\n\nWhat is to be done if the student in question has not done a question? We are required to fill an answer in the quantitative part. We can’t leave it blank.",
      "date": "Apr 5",
      "links": [
        "@carlton",
        "@Jivraj"
      ]
    },
    {
      "post_id": "616955",
      "content": "Just put zero there. Since all the quantitative answers are positive.",
      "date": "Apr 8",
      "links": []
    },
    {
      "post_id": "616997",
      "content": "Hi Sir, How to get to know about the peer reveiew , till now i have not got any intimation for doing peer review",
      "date": "Apr 8",
      "links": []
    },
    {
      "post_id": "617020",
      "content": "You were sent an email about it. With the peers to review. It came from the official TDS email.\n\nYou were sent an email on the 1st of April.\n\nKind regards",
      "date": "Apr 8",
      "links": []
    },
    {
      "post_id": "617532",
      "content": "Hi @carlton sir,\nI have received the bonus marks email with 5 additional HTML files for peer review. However, I noticed that one of these files was also included in the initial peer grading email.\n\nCould you please clarify if I should fill out the peer review form for this particular file again, or should I skip it since it has already been graded?\n\n1000041565\n1280×349 87.7 KB",
      "date": "Apr 9",
      "links": [
        "@carlton",
        "1000041565\n1280×349 87.7 KB"
      ]
    },
    {
      "post_id": "617660",
      "content": "Thanks we have made a correction and sent an email.",
      "date": "Apr 10",
      "links": []
    }
  ]
}