{
  "url": "https://discourse.onlinedegree.iitm.ac.in/t/tds-roe-exam-date-shift/168458/8",
  "main_post": {
    "post_id": "599694",
    "content": "@carlton @jkmadathil Sir please shift the ROE date to another date because we really need time to understand all these stuffs as these are so hard for beginners like us and there is quiz 2 and we have to prepare for that also.\nSir please understand our situation and pay attention to our concern.",
    "date": "Feb 25",
    "links": [
      "@carlton",
      "@jkmadathil"
    ]
  },
  "replies": [
    {
      "post_id": "599698",
      "content": "Also, it seems impossible to complete it in 45 minutes.",
      "date": "Feb 25",
      "links": []
    },
    {
      "post_id": "599830",
      "content": "you got the wrong Anand here. You perhaps wanted to tag the faculty of this course s.anand (I’m purposely not tagging him; you may do so)",
      "date": "Feb 26",
      "links": []
    },
    {
      "post_id": "599831",
      "content": "I feel for you because you constantly get incorrectly tagged. On the plus side you are famous (or infamous depending on perspective  )\n\nKind regards",
      "date": "Feb 26",
      "links": []
    },
    {
      "post_id": "599834",
      "content": "Just FYI the correct tag to use for Professor Anand of TDS is @s.anand\n\nAlso ROE date will not be moved because its an exam date that has been set before the term starts. This is just part of the policy of the BS Programme. Exam dates never get moved except in truly exceptional circumstances.\n\nKind regards",
      "date": "Feb 26",
      "links": [
        "@s.anand"
      ]
    },
    {
      "post_id": "599871",
      "content": "Sir I understand but it will badly affects our CGPA.",
      "date": "Feb 26",
      "links": []
    },
    {
      "post_id": "600076",
      "content": "Sir can you at least increase the time limit from 45 minutes to 1 hour?",
      "date": "Feb 26",
      "links": []
    },
    {
      "post_id": "600243",
      "content": "The time limit for ROE will be set according to the difficulty level of the ROE.\n\nKind regards",
      "date": "Feb 26",
      "links": []
    }
  ]
}