{
  "url": "https://discourse.onlinedegree.iitm.ac.in/t/tds-jan-25-imp-announcement-for-project-2/170413/6",
  "main_post": {
    "post_id": "608305",
    "content": "Dear Learners,\nProf. Anand Live Session Alert!\n Date & Time: Wednesday, March 19, 2025 · 9:00 – 10:00 PM (IST)  March 19, 2025 9:00 PM\n Speaker: Professor Anand (@s.anand)\n Topic: Project 2 Q&A + General Course Queries\n Google Meet Link: Join Here\n How to Prepare for the Live Session\n Ask Questions in Advance on THIS thread\nIf you have doubts about Project 2, post your specific questions in this thread.\nStruggling to phrase your question clearly? Use the TDS GPT Assistant to refine your question before posting.\n TDS GPT Assistant\nPlease keep this thread clean and do not use it for banter or solutions. Its only for questions.\nCheck if someone else has already asked the question before posting. Instead just use a thumbs up.\nIf you still feel the question has not been asked exactly the way you would frame it, then go ahead and ask it.\n Continue Using the original Project 2 Discussion Thread for solutions\nThe Project 2 Discussion Thread is still available for peer and faculty support.\n Discussion Thread Link\n Purpose of This Thread\nProf. Anand will review questions in advance to ensure an effective live session.\nPlease post only relevant, well-structured questions here.\n\nDon’t miss this opportunity! Get your questions ready and join the session.\n\n\nKind regards,\nTDS Team",
    "date": "Mar 19",
    "links": [
      "",
      "",
      "@s.anand",
      "Join Here",
      "",
      "",
      "TDS GPT Assistant",
      "",
      "original Project 2 Discussion Thread",
      "Discussion Thread Link",
      ""
    ]
  },
  "replies": [
    {
      "post_id": "608526",
      "content": "Hi @carlton ,\n\nWill this session be recorded and shared later?\nIt conflicts with live session of BA and that session is specially told that It will not be recorded.",
      "date": "Mar 19",
      "links": [
        "@carlton"
      ]
    },
    {
      "post_id": "608604",
      "content": "@carlton sir, I too prefer a recording. I did not even attend the session due to personal work which I couldn\"t avoid. Pls support",
      "date": "Mar 20",
      "links": [
        "@carlton"
      ]
    },
    {
      "post_id": "608612",
      "content": "@kushabarodekar @Muthupalaniappan\n\nAs usual recording will be uploaded to youtube.",
      "date": "Mar 20",
      "links": [
        "@kushabarodekar",
        "@Muthupalaniappan"
      ]
    },
    {
      "post_id": "608759",
      "content": "Live Session - TDS\n\nThis is the recording of the session.\n\nKind regards",
      "date": "Mar 20",
      "links": [
        "Live Session - TDS"
      ]
    }
  ]
}