{
  "url": "https://discourse.onlinedegree.iitm.ac.in/t/end-term-tds/171668/13",
  "main_post": {
    "post_id": "614904",
    "content": "@carlton can you give me some advice regarding preparation for end term exam.",
    "date": "Apr 3",
    "links": [
      "@carlton"
    ]
  },
  "replies": [
    {
      "post_id": "614917",
      "content": "any question papers for preparations and on what basis the questions would come",
      "date": "Apr 3",
      "links": []
    },
    {
      "post_id": "616352",
      "content": "@carlton @Jivraj @Saransh_Saini\n\nHi,\n\nWe have 6 days for ET. I request you to share module weightage (if it’s not secret).\nPlease release mock as early as possible because this term course content has been changed so pyqs won’t help much.\n\nThanks\nSujay D",
      "date": "Apr 7",
      "links": [
        "@carlton",
        "@Jivraj",
        "@Saransh_Saini"
      ]
    },
    {
      "post_id": "616358",
      "content": "@carlton, please release the mock or give us the proper resources. The resources in the course introduction and the pyqs have no similarities. Many questions come from other topics, such as MLT and many others. Those who didn’t complete it find it too difficult. Please don’t keep us in delusion.",
      "date": "Apr 7",
      "links": [
        "@carlton"
      ]
    },
    {
      "post_id": "616381",
      "content": "Going through GA’s would be good idea.",
      "date": "Apr 7",
      "links": []
    },
    {
      "post_id": "616386",
      "content": "Yes sir please it will help us to prepare better for end term.",
      "date": "Apr 7",
      "links": []
    },
    {
      "post_id": "616387",
      "content": "Yes sir we all are facing the same problem.",
      "date": "Apr 7",
      "links": []
    },
    {
      "post_id": "616397",
      "content": "The Tuesday and the Thursday session will cover end term including a mock.\n\nEnd term is usually very easy for TDS. A look at prior end terms is a good indicator of how easy they are.\n\nKind regards",
      "date": "Apr 7",
      "links": []
    },
    {
      "post_id": "616415",
      "content": "@Carlton With just 5 days left, I wanted to ask for a quick suggestion.\n\nI’m prioritizing PYQs for sure, but between revisiting lectures and attending TA sessions (both quite time-consuming), which one would you recommend focusing on for better returns?\n\nAlso, if possible, could you please point out the top 2–3 most important topics—maybe things like LLM, Data Sourcing, etc.—to give more attention to?",
      "date": "Apr 7",
      "links": [
        "@Carlton"
      ]
    },
    {
      "post_id": "616425",
      "content": "I recommend attending the Tues and Thurs session this week or watching the recordings. Its the same every term, those that attend the session score the best marks. I say this because there is no way for me to convey in a discourse post all the important things to focus on. But I can do that in a 2 hour session.",
      "date": "Apr 7",
      "links": []
    },
    {
      "post_id": "616993",
      "content": "Practice PYQ Drive link provied in Tuesdays End term revision Session\n\ndocs.google.com\nPYQ Sheet\n\nThis Sheet is private",
      "date": "Apr 8",
      "links": [
        "docs.google.com",
        "",
        "PYQ Sheet"
      ]
    },
    {
      "post_id": "617150",
      "content": "Sir could you provide the recording for yesterday’s live session as in youtube its not uploaded yet\nThank you",
      "date": "Apr 9",
      "links": []
    },
    {
      "post_id": "617151",
      "content": "Sir will the recent 3 pyqs be sufficient as the pyqs before 2024 are different compared to the recent ones. Could u pls let us know about it\nThank you",
      "date": "Apr 9",
      "links": []
    }
  ]
}